Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/ОбменМатериаламиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="9bc99607-c6e6-435f-9cd6-d09156ac3541">
  <name>ОбменМатериаламиСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПакетаДанных</name>
    <type>
      <types>EnumRef.ТипыПакетовДанныхСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПакетДляЭкспорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеДоДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьДанныеПослеДаты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьТолькоПомеченныеНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранитьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИмпортированныйПакет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИмпортИзКаталогаШаблонов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРедакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодредакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлементыДляЭкспорта</name>
    <attributes>
      <name>СсылкаНаЭлемент</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопустимыеПакетыДанных</name>
    <attributes>
      <name>НомерПакетаДанных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПакетДанных</name>
      <type>
        <types>ExchangePlanRef.ОбменМатериаламиСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

Examinator/src/ExchangePlans/ОбменМатериаламиСУЗ/Forms/ФормаЭкспортаXML/Module.bsl
#Область ОписаниеПеременных

Перем КодГлавногоУзла; // Код узла, в который выполняется загрузка данных
Перем мДатаПустая; // Хранит пустую дату
Перем МассивСсылочныхОбъектовМетаданных; // Справочники и планы видов характеристик
Перем ДеревоПодчиненныхОбъектовМетаданных; // Хранит подчиненные справочники в виде дерева.
Перем ДеревоРегистровСведенийОбъектовМетаданных; // Хранит дерево регистров в которых хранятся
                                                 // Различные данные объектов

Перем ПоставщикСводаЗнаний; // Во время экспорта переменная заполняется тем поставщиком,
                            // Который следует предпочесть при экспорте данных объекта.

Перем ЗарегистрированныеЭлементы; // Массив. Хранит только ссылочные типы (не данные регистров),
                                  // Которые были зарегистрированы для изменения. В массив
								  // Включаются только основные элементы (без своих родителей).

								  
#КонецОбласти


#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	/////////////////////////////////////////////////////////////////////////////////
	// Делаем проверки
	
	Если НЕ ЗначениеЗаполнено(Параметры.Узел)
		ИЛИ Параметры.Узел = ПланыОбмена.ОбменМатериаламиСУЗ.ЭтотУзел() Тогда
		
		Текст = НСтр("ru = 'Не найден узел для экспорта'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////////////
	// Получаем основные переменные
	
	Узел = Параметры.Узел;
	
	Наименование = Узел.Наименование;
	Номер        = Узел.НомерОтправленного;
	
	КодГлавногоУзла = ОбъектыСУЗ.ПолучитьПараметрыГлавногоУзла();
    мДатаПустая     = Дата("00010101");
	
	ДеревоПодчиненныхОбъектовМетаданных       = ПланыОбмена.ОбменМатериаламиСУЗ.ПолучитьДеревоПодчиненныхОбъектовМетаданных();
	МассивСсылочныхОбъектовМетаданных         = ПланыОбмена.ОбменМатериаламиСУЗ.ПолучитьМассивСсылочныхОбъектовМетаданных();
	ДеревоРегистровСведенийОбъектовМетаданных = ПланыОбмена.ОбменМатериаламиСУЗ.ПолучитьДеревоРегистровСведенийОбъектовМетаданных(МассивСсылочныхОбъектовМетаданных);
	
	/////////////////////////////////////////////////////////////////////////////////
	// Регистрируем элементы узла
	
	НаименованиеПакета = Узел.Наименование;
	НомерПакета        = Узел.НомерОтправленного;
	
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
	
	ЗарегистрированныеЭлементы = Новый Массив();
	
	Для Каждого Индекс Из Узел.ЭлементыДляЭкспорта Цикл
		
		СсылкаНаЭлемент = Индекс.СсылкаНаЭлемент;
		
		// Устанавливаем текущего предпочитаемого поставщика,
		// Чтобы при экспорте в приоритете были именно данные этого поставщика.
		
		// Примечание: в пакете данных сохраняются данные от всех трех поставщиков:
		// - предпочитаемого в пакете
		// - предпочитаемого в экспортируемом своде знаний (хранится в переменной ПоставщикСводаЗнаний)
		// - поставщика последней сохранений версии
		//
		// Но, если указана опция СохранитьПоследнююВерсию, то предпочитаемый
		// в пакете поставщик станет последним сохраненным.
		
		ПоставщикСводаЗнаний = Неопределено; // Если обычный элемент, не свод знаний и не его элемент.
		
		Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.СводыЗнанийСУЗ")
			И НЕ СсылкаНаЭлемент.ЭтоГруппа
			И СсылкаНаЭлемент.ПоказыватьПоследнююВерсию Тогда
			ПоставщикСводаЗнаний = СсылкаНаЭлемент.ПредпочитатьПоставщика;
		КонецЕсли;
		
		Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.СодержаниеСУЗ")
			И СсылкаНаЭлемент.Владелец.ПоказыватьПоследнююВерсию Тогда
			ПоставщикСводаЗнаний = СсылкаНаЭлемент.Владелец.ПредпочитатьПоставщика;
		КонецЕсли;
		
		ЗарегистрироватьЭлементПакетаДанных(Узел, СсылкаНаЭлемент);
		
		Если СсылкаНаЭлемент.ЭтоГруппа Тогда
			
			ИмяСправочника = Метаданные.НайтиПоТипу(ТипЗнч(СсылкаНаЭлемент)).Имя;
			
			ТекстЗапроса = "ВЫБРАТЬ
			|	"+ИмяСправочника+".Ссылка
			|ИЗ
			|	Справочник."+ИмяСправочника+" КАК "+ИмяСправочника+"
			|ГДЕ
			|	"+ИмяСправочника+".Ссылка В ИЕРАРХИИ(&Родитель)";

			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Родитель", СсылкаНаЭлемент); 
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ЗарегистрироватьЭлементПакетаДанных(Узел, Выборка.Ссылка);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗарегистрироватьПредопределенныеЭлементыПакетаДанных(Узел);
	
	/////////////////////////////////////////////////////////////////////////////////
	// Записываем файл XML во временное хранилище
	
	СчетчикХодаЭкспорта = 0;
	
	НомерСборки = Узел.НомерОтправленного + 1;
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	
	// Создаем объект записи XML
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	ЗаписьXML.ЗаписатьОбъявлениеXML();

	// Создаем новое сообщение.
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Узел);

	ЗаписьXML.ЗаписатьНачалоЭлемента("ИнформацияОПакетеДанных");
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
		ЗаписьXML.ЗаписатьТекст(Узел.Наименование);
		ЗаписьXML.ЗаписатьКонецЭлемента();
	
		// Записываем данные о совместимой конфигурации
		
		ТекущаяВерсия = ЭлектронныеРесурсыСУЗ.ВерсияПодсистемы();
		МассивНомеровВерсии = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ТекущаяВерсия, ".");
		ТекущаяВерсия = Строка(МассивНомеровВерсии[0] + "." + МассивНомеровВерсии[1] + "." + МассивНомеровВерсии[2]);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопустимаяВерсия");
		ЗаписьXML.ЗаписатьТекст(ТекущаяВерсия);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		// Записываем данные о допустимых номерах пакетов данных.
		Если Узел.ДопустимыеПакетыДанных.Количество() > 0 Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ДопустимыеПакетыДанных");
			
			Для каждого Элемент Из Узел.ДопустимыеПакетыДанных Цикл
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ПакетДанных");
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Код");
				ЗаписьXML.ЗаписатьТекст(Строка(Элемент.ПакетДанных.Код));
				ЗаписьXML.ЗаписатьКонецЭлемента();
		
				ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
				ЗаписьXML.ЗаписатьТекст(Строка(Элемент.ПакетДанных.Наименование));
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ДопустимыйНомер");
				ЗаписьXML.ЗаписатьТекст(Строка(Элемент.НомерПакетаДанных));
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьКонецЭлемента();

			КонецЦикла;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();

		КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	НомерСборки = ЗаписьСообщения.НомерСообщения;
	
	// Получаем выборку измененных данных
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, НомерСборки);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементыДляЗагрузки");
	
	Пока ВыборкаИзменений.Следующий() Цикл
		
		ОбъектДляЗаписи = ВыборкаИзменений.Получить();	
		
		Если ТипЗнч(ОбъектДляЗаписи) = Тип("РегистрСведенийНаборЗаписей.ДанныеФайлыСУЗ") Тогда		
			ОбъектДляЗаписи.ПриОтправкеНабора();		
		КонецЕсли;
		
		ЗаписатьXML(ЗаписьXML, ОбъектДляЗаписи);		
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементыДляУдаления");
	ЗаписьXML.ЗаписатьКонецЭлемента();	
	
	// Завершаем запись сообщения
	ЗаписьСообщения.ЗакончитьЗапись();
	ЗаписьXML.Закрыть();
	
	// Меняем в XML файле коды узлов From и To
	
	ВременныйФайлЧтение = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8); 
	
	// Во второй временный файл записывается окончательный вариант пакета данных.
	ИмяФайлаПакетаДанных = ПолучитьИмяВременногоФайла("xml");
	ВременныйФайлЗапись = Новый ЗаписьТекста(ИмяФайлаПакетаДанных, КодировкаТекста.UTF8); 
		
	Строка = ВременныйФайлЧтение.ПрочитатьСтроку(); 
	ВременныйФайлЗапись.ЗаписатьСтроку(Строка); 
	
	КолЗамен = 0;
	Пока Строка <> Неопределено Цикл 
		
		Если КолЗамен < 2 Тогда
			
			Строка = ВременныйФайлЧтение.ПрочитатьСтроку(); 
			
			Если Найти(Строка, Узел.Код) > 0 Тогда
				Строка = СтрЗаменить(Строка,Узел.Код,КодГлавногоУзла);	
				КолЗамен = КолЗамен + 1;
			ИначеЕсли Найти(Строка, КодГлавногоУзла) > 0 Тогда
				Строка = СтрЗаменить(Строка,КодГлавногоУзла,Узел.Код);
				КолЗамен = КолЗамен + 1;
			КонецЕсли;
			
			ВременныйФайлЗапись.ЗаписатьСтроку(Строка);
			
		Иначе
			
			Строка = ВременныйФайлЧтение.Прочитать(50000); 
			
			ВременныйФайлЗапись.Записать(Строка);
			
		КонецЕсли;
		
	КонецЦикла;

	
	ВременныйФайлЧтение.Закрыть();
	ВременныйФайлЗапись.Закрыть();	
	
	УдалитьФайлы(ИмяФайла); // Удаляем первый временный файл
	
	ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ИмяФайлаПакетаДанных);
	
	АдресПакетаДанных = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, ЭтотОбъект.УникальныйИдентификатор);
	
	УдалитьФайлы(ИмяФайлаПакетаДанных); // Удаляем второй временный файл
	
	Результат = Результат + НСтр("ru = 'Экспорт успешно выполнен'");
	
	Номер = Узел.НомерОтправленного;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПакетДанных(Команда)
	
	Если ЗначениеЗаполнено(АдресПакетаДанных) Тогда
		
		Оповещение = Новый ОписаниеОповещения("СохранитьПакетДанныхПродолжение", ЭтотОбъект);
		ИмяФайлаПакета =  Наименование + " (" + Номер + ")" + ".xml";
		
		ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
		ПараметрыСохранения.Диалог.Заголовок = НСтр("ru = 'Выберите файл для сохранения пакета'");
		ПараметрыСохранения.Диалог.Фильтр    = НСтр("ru = 'Файлы пакетов (*.xml)|*.xml'");
				
		ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, АдресПакетаДанных, ИмяФайлаПакета, ПараметрыСохранения);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПакетДанныхПродолжение(ПолученныеФайлы, Контекст) Экспорт
	
	Если ПолученныеФайлы <> Неопределено 
		И ПолученныеФайлы.Количество() > 0 Тогда
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Сохранение в файл'"),,
			НСтр("ru = 'Пакет данных успешно сохранен.'"), БиблиотекаКартинок.Успешно32);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(АдресПакетаДанных) Тогда
		Элементы.СохранитьПакетДанных.Доступность = Истина;
	Иначе
		Элементы.СохранитьПакетДанных.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Регистрирует элементы для экспорта в пакет данных.
//
// Параметры
//  Узел                          – Ссылка на экспортируемый узел (пакет данных).
//  СсылкаНаЭлемент               – Ссылка на экспортируемый элемент.
//                                  Может быть разных типов. Обычно ссылка на справочники.
//  ИсключитьПодчиненныеЭлементы  - Если Истина, то не будут регистрироваться элементы
//                                  подчиненных данному элементу справочников.
//
&НаСервере
Процедура ЗарегистрироватьЭлементПакетаДанных(Узел, Знач СсылкаНаЭлемент, Знач ИсключитьПодчиненныеЭлементы=Ложь) 
	
	Если НЕ ВозможноДвижениеПоИерархии(Узел, СсылкаНаЭлемент) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВозможноЗарегистрироватьИзменения(Узел, СсылкаНаЭлемент) Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, СсылкаНаЭлемент); // Регистрируем текущий элемент.
		ЗарегистрированныеЭлементы.Добавить(СсылкаНаЭлемент);
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(СсылкаНаЭлемент));
	
	// Регистрируем родителя
	
	ЗарегистрироватьРодителяЭлементаПакетаДанных(Узел, СсылкаНаЭлемент);
	
	// Регистрируем реквизиты
	
	Для каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		ЗарегистрироватьЭлементПакетаДанных(Узел, СсылкаНаЭлемент[Реквизит.Имя]);
	КонецЦикла;
	
	// Табличные части
	
	Для каждого ТабличнаяЧасть Из ОбъектМетаданных.ТабличныеЧасти Цикл
		ИмяТабличнойЧасти = ТабличнаяЧасть.Имя;
		Для каждого РеквизитТЧ Из ТабличнаяЧасть.Реквизиты Цикл
			ИмяРеквизита = РеквизитТЧ.Имя;
			Для каждого ЭлементТЧ Из СсылкаНаЭлемент[ИмяТабличнойЧасти] Цикл
				ЗарегистрироватьЭлементПакетаДанных(Узел, ЭлементТЧ[ИмяРеквизита]);					
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;
	
	// Регистрируем подчиненные справочники
	
	Если НЕ ИсключитьПодчиненныеЭлементы Тогда

		СтрокаВДеревеПодчиненныхОМ = ДеревоПодчиненныхОбъектовМетаданных.Строки.Найти(ОбъектМетаданных, "ОбъектМетаданных");
		
		Если СтрокаВДеревеПодчиненныхОМ <> Неопределено Тогда
			
			Для каждого ПодчиненныйСправочник Из СтрокаВДеревеПодчиненныхОМ.Строки Цикл
			
				ПодчиненныеЭлементыСправочника = Справочники[ПодчиненныйСправочник.ОбъектМетаданных.Имя].Выбрать(,СсылкаНаЭлемент);
				Пока ПодчиненныеЭлементыСправочника.Следующий() Цикл
					ЗарегистрироватьЭлементПакетаДанных(Узел, ПодчиненныеЭлементыСправочника.Ссылка);
				КонецЦикла;
			
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Регистрируем данные регистров в которых хранятся различные данные объектов
	
	Если НЕ Узел.ЭкспортироватьТолькоПомеченныеНаУдаление ИЛИ (Узел.ЭкспортироватьТолькоПомеченныеНаУдаление И СсылкаНаЭлемент.ПометкаУдаления) Тогда
		
		СтрокаВДеревеРегистровОМ = ДеревоРегистровСведенийОбъектовМетаданных.Строки.Найти(ОбъектМетаданных, "ОбъектМетаданных");
		
		Если СтрокаВДеревеРегистровОМ <> Неопределено Тогда
			
			Для каждого ПодчиненныйРегистр Из СтрокаВДеревеРегистровОМ.Строки Цикл
				
				Если ПодчиненныйРегистр.РегистрСДаннымиСУЗ Тогда // Данные объектов СУЗ
					
					// Набор данных последней актуальной версии предпочитаемого
					// В пакете данных поставщика.
					
					Если Узел.ЭкспортироватьПоследнююВерсию Тогда
						
						ПредпочитаемыйПоставщик = Узел.ПредпочитатьПоставщика;
						
						Если Узел.СохранитьПоследнююВерсию Тогда
							
							ПоследняяВерсия = ОбъектыСУЗ.ПолучитьПоследнююВерсию(СсылкаНаЭлемент, ПредпочитаемыйПоставщик);
							
							// Если версия и поставщик объекта не совпадают с теми, что предпочитаются
							// В пакете данных, то изменяем сам объект, так как иначе после экспорта
							// Могут отобразиться данные другого поставщика без доп. настройки конфигурации.
							
							Если СсылкаНаЭлемент.Версия <> ПоследняяВерсия.Версия
								ИЛИ СсылкаНаЭлемент.Поставщик <> ПоследняяВерсия.Поставщик Тогда
								
								ОбъектЭлемента = СсылкаНаЭлемент.ПолучитьОбъект();
								
								ОбъектЭлемента.Версия    = ПоследняяВерсия.Версия;
								ОбъектЭлемента.Поставщик = ПоследняяВерсия.Поставщик;
								
								ОбъектЭлемента.Записать();
								
								Результат = Результат + НСтр("ru = 'Объект изменен. '") + ОбъектМетаданных.Имя + " : """ + ОбъектЭлемента.Наименование + """";
								
							КонецЕсли;
							
							
						КонецЕсли;
						
					Иначе
						
						ПредпочитаемыйПоставщик = Неопределено;
						
					КонецЕсли;
					
					// Сохраняем данные поставщика, предпочитаемого в пакете данных.
					Если ПредпочитаемыйПоставщик <> Неопределено Тогда
						НаборДанных = ПолучитьНаборДанныхОбъектаСУЗ(СсылкаНаЭлемент, Истина, ПредпочитаемыйПоставщик);
						ЗарегистрироватьНаборДанных(Узел, НаборДанных);
					КонецЕсли;
					
					// Сохраняем данные поставщика свода знаний.
					Если ПоставщикСводаЗнаний <> Неопределено Тогда // ПоставщикСводаЗнаний - переменная в модуле
						НаборДанных = ПолучитьНаборДанныхОбъектаСУЗ(СсылкаНаЭлемент, Истина, ПоставщикСводаЗнаний);
						ЗарегистрироватьНаборДанных(Узел, НаборДанных);
					КонецЕсли;
					
					// Сохраняем набор данных последней сохраненной версии объекта. Существует всегда.
					НаборДанных = ПолучитьНаборДанныхОбъектаСУЗ(СсылкаНаЭлемент, Ложь);
					ЗарегистрироватьНаборДанных(Узел, НаборДанных);
					
				Иначе // Другие регистры с данными объектов
					
					ИмяРегистра = ПодчиненныйРегистр.ОбъектМетаданных.Имя;
					ИмяИзмерения = ПодчиненныйРегистр.Измерение.Имя;
					
					ДругиеИзмеренияСОсновнымОтбором = Новый Массив;
					
					Для каждого Измерение Из ПодчиненныйРегистр.ОбъектМетаданных.Измерения Цикл
						Если Измерение.ОсновнойОтбор
							И Измерение.Имя <> ИмяИзмерения Тогда
							ДругиеИзмеренияСОсновнымОтбором.Добавить(Измерение.Имя); 					
						КонецЕсли;
					КонецЦикла;
					
					// Регистрируем все данные регистра для текущего элемента.
					
					НаборДанных = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей(); 
					НаборДанных.Отбор[ИмяИзмерения].Установить(СсылкаНаЭлемент);
					
					НаборДанных.Прочитать();
					
					Если НаборДанных.Количество() > 0 Тогда
						
						Если ДругиеИзмеренияСОсновнымОтбором.Количество() = 0 Тогда
							ЗарегистрироватьНаборДанных(Узел, НаборДанных);
						Иначе
							
							Для каждого Запись Из НаборДанных Цикл
							
								НаборДанныхДляЗаписи =  РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей(); 
								НаборДанныхДляЗаписи.Отбор[ИмяИзмерения].Установить(СсылкаНаЭлемент);
								
								Для каждого ДопИзмерение Из ДругиеИзмеренияСОсновнымОтбором Цикл
									НаборДанныхДляЗаписи.Отбор[ДопИзмерение].Установить(Запись[ДопИзмерение]);
								КонецЦикла;
								
								НаборДанныхДляЗаписи.Прочитать();
								
								ЗарегистрироватьНаборДанных(Узел, НаборДанныхДляЗаписи);
								
							КонецЦикла;
							
						КонецЕсли;
						
						Для каждого ИзмерениеРегистра Из ПодчиненныйРегистр.ОбъектМетаданных.Измерения Цикл
							Для каждого Запись Из НаборДанных Цикл
								ЗарегистрироватьЭлементПакетаДанных(Узел, Запись[ИзмерениеРегистра.Имя]);					
							КонецЦикла;
						КонецЦикла;
						
						Для каждого РеквизитРегистра Из ПодчиненныйРегистр.ОбъектМетаданных.Реквизиты Цикл
							Для каждого Запись Из НаборДанных Цикл
								ЗарегистрироватьЭлементПакетаДанных(Узел, Запись[РеквизитРегистра.Имя]);					
							КонецЦикла;
						КонецЦикла;
						
						Для каждого РесурсРегистра Из ПодчиненныйРегистр.ОбъектМетаданных.Ресурсы Цикл
							Для каждого Запись Из НаборДанных Цикл
								ЗарегистрироватьЭлементПакетаДанных(Узел, Запись[РесурсРегистра.Имя]);					
							КонецЦикла;
						КонецЦикла;
						
					КонецЕсли;
					
					
					
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Регистрируем владельца
	
	ЗарегистрироватьВладельцаЭлементаПакетаДанных(Узел, СсылкаНаЭлемент);
	
КонецПроцедуры

// Регистрирует владельца
//
&НаСервере
Процедура ЗарегистрироватьВладельцаЭлементаПакетаДанных(Узел, Знач СсылкаНаЭлемент)
	
	Попытка
		ВладелецЭлемента = СсылкаНаЭлемент.Владелец;
	Исключение
		Возврат;
	КонецПопытки;
	
	Если ВладелецЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ВозможноДвижениеПоИерархии(Узел, СсылкаНаЭлемент.Владелец) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВозможноЗарегистрироватьИзменения(Узел, СсылкаНаЭлемент.Владелец) Тогда
		// Владельца следует регистрировать как элемент, так как у него
		// Могут быть свои реквизиты, которые нужно регистрировать.
		// При этом исключаем регистрацию элементов подчиненных справочников,
		// Так как владелец может регистрироваться из своего подчиненного
		// Элемента и регистрация других подчиненных не требуется.
		// Например, мы регистрируем часть свода знаний и регистрируем владельца
		//- свод знаний. При этом все подчиненные элементы своду знаний не
		// Регистрируются.
		ЗарегистрироватьЭлементПакетаДанных(Узел, СсылкаНаЭлемент.Владелец, Истина); // Регистрируем только владельца и не двигаемся дальше по его иерархии.
	КонецЕсли;
	
КонецПроцедуры

// Регистрирует набор данных
//
&НаСервере
Процедура ЗарегистрироватьНаборДанных(Узел, НаборДанных)

	ПоследняяДатаИзмененияДанных = мДатаПустая;
	
	Для Каждого ЗаписьДанных Из НаборДанных Цикл
		Если ЗаписьДанных.ДатаИзменения > ПоследняяДатаИзмененияДанных Тогда
			ПоследняяДатаИзмененияДанных = ЗаписьДанных.ДатаИзменения;
		КонецЕсли;
	КонецЦикла;
		
	Если ПоследняяДатаИзмененияДанных >= Узел.ЭкспортироватьДанныеПослеДаты Тогда
		Если Узел.ЭкспортироватьДанныеДоДаты = мДатаПустая ИЛИ ПоследняяДатаИзмененияДанных <= Узел.ЭкспортироватьДанныеДоДаты Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, НаборДанных);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Регистрирует родителя
//
&НаСервере
Процедура ЗарегистрироватьРодителяЭлементаПакетаДанных(Узел, Знач СсылкаНаЭлемент)
	
	Если НЕ ВозможноДвижениеПоИерархии(Узел, СсылкаНаЭлемент.Родитель) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВозможноЗарегистрироватьИзменения(Узел, СсылкаНаЭлемент.Родитель) Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, СсылкаНаЭлемент.Родитель); // Регистрируем текущего родителя.
	КонецЕсли;
	
	ЗарегистрироватьРодителяЭлементаПакетаДанных(Узел, СсылкаНаЭлемент.Родитель); // Рекурсивно регистрируем вышележащих родителей.
		
КонецПроцедуры

// Регистрирует предопределенные элементы
//
&НаСервере
Процедура ЗарегистрироватьПредопределенныеЭлементыПакетаДанных(Узел)
	
	Для каждого Элемент Из МассивСсылочныхОбъектовМетаданных Цикл
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	"+Элемент.Имя+".Ссылка
		|ИЗ
		|	"+Элемент.ПолноеИмя()+" КАК "+Элемент.Имя+"
		|ГДЕ
		|	"+Элемент.Имя+".Предопределенный = ИСТИНА";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			
			Пока РезультатЗапроса.Следующий() Цикл
				ЗарегистрироватьЭлементПакетаДанных(Узел, РезультатЗапроса.Ссылка);
			КонецЦикла;
				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет возможность регистрации элемента для последующего экспорта
//
&НаСервере
Функция ВозможноЗарегистрироватьИзменения(Узел, Знач СсылкаНаЭлемент)
	
	// Если не нужно экспортировать только помеченные на удаление, то
	// Регистрируем изменения. Проверка на то, что объект помечен на удаление
	// Производиться в функции "ВозможноДвижениеПоИерархии".
	Если НЕ Узел.ЭкспортироватьТолькоПомеченныеНаУдаление
	 	ИЛИ (Узел.ЭкспортироватьТолькоПомеченныеНаУдаление И СсылкаНаЭлемент.ПометкаУдаления) Тогда
		
		// Проверяем вхождение во временной диапазон 
		Если СсылкаНаЭлемент.ДатаИзменения >= Узел.ЭкспортироватьДанныеПослеДаты Тогда
			Если Узел.ЭкспортироватьДанныеДоДаты = мДатаПустая ИЛИ СсылкаНаЭлемент.ДатаИзменения <= Узел.ЭкспортироватьДанныеДоДаты Тогда
				
				Возврат Истина;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции // ЗарегистрироватьИзмененияВозможно()

// Проверяет необходимость регистрации связанных элементов.
//
&НаСервере
Функция ВозможноДвижениеПоИерархии(Узел, Знач СсылкаНаЭлемент)

	Если НЕ ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(СсылкаНаЭлемент));
	
	Если МассивСсылочныхОбъектовМетаданных.Найти(ОбъектМетаданных) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Для предотвращения бесконечного цикла:
	
//	Если ПланыОбмена.ИзменениеЗарегистрировано(Узел, СсылкаНаЭлемент) Тогда
//		Возврат Ложь;
//	КонецЕсли;

//  Примечание: Для того, чтобы не регистрировать элемент два раза используется
//  массив ЗарегистрированныеЭлементы, а не встроенная таблица изменений. Это необходимо,
//  так как в некоторых случаях, мы можем косвенно зарегистрировать владельца или родителя элемента,
//  не выгрузив все связанные с ними элементы и потом эти элементы будут уже потеряны навсегда.
//  Например, такая ситуация возникает в справочники "Элементы рубрикатора", где родитель элемента
//  является полноправным элементом и должен быть обработан полностью позднее.


	Если ЗарегистрированныеЭлементы.Найти(СсылкаНаЭлемент) <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	// Помеченные на удаление не регистрируем и не двигаемся дальше по иерерархии.
	Если НЕ Узел.ЭкспортироватьТолькоПомеченныеНаУдаление И СсылкаНаЭлемент.ПометкаУдаления Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
	 
КонецФункции // ВозможноДвижениеПоИерархии()

// Получает набор данных
//
&НаСервере
Функция ПолучитьНаборДанныхОбъектаСУЗ(СсылкаНаЭлемент, Знач ПолучитьПоследнююВерсию=Ложь, ПредпочитатьПоставщика=Неопределено)
	
	ИмяРегистра = ОбъектыСУЗ.ПолучитьИмяРегистраСДанными(СсылкаНаЭлемент);
	ЗаписиВРегистре = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	ЗаписиВРегистре.Отбор.СсылкаНаОбъектСУЗ.Установить(СсылкаНаЭлемент);
	
	Если ПолучитьПоследнююВерсию Тогда
		ПоследняяВерсия = ОбъектыСУЗ.ПолучитьПоследнююВерсию(СсылкаНаЭлемент, ПредпочитатьПоставщика);
		ЗаписиВРегистре.Отбор.Поставщик.Установить(ПоследняяВерсия.Поставщик);
		ЗаписиВРегистре.Отбор.Версия.Установить(ПоследняяВерсия.Версия);
	Иначе
		ЗаписиВРегистре.Отбор.Поставщик.Установить(СсылкаНаЭлемент.Поставщик);
		ЗаписиВРегистре.Отбор.Версия.Установить(СсылкаНаЭлемент.Версия);
	КонецЕсли;
	
	ЗаписиВРегистре.Прочитать();
	
	Возврат ЗаписиВРегистре;
	
КонецФункции


#КонецОбласти
